<?php

use yii\db\Migration;

/**
 * Создается таблица "Задачи".
 */
class m250117_071929_create_tasks_table extends Migration
{
    /**
     * Наименование таблицы, которая создается
     */
    const TABLE_NAME= 'tasks';

    public function safeUp()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_unicode_ci ENGINE=InnoDB COMMENT "Задачи"';
        }
        $this->createTable(self::TABLE_NAME, [
            'id' => $this->primaryKey(),
            'date' => $this->dateTime()->comment('Дата'),
            'operation' => $this->string(255)->comment('Название операции '),
            'shift' => "ENUM('1', '2')",
            'line' => $this->integer()->comment('номер линии'),
            'workcenter' => $this->string(50)->unique()->comment('отбор в бублике'),
            'plan' => $this->integer()->notNull()->comment('максимальное значение в бублике'),
            'fact' => $this->integer()->notNull()->comment('На сколько заполнить бублик зеленым цветом относительно plan.'),
            'operator' => $this->string()->comment('фио сотрудника'),

        ], $tableOptions);
        $this->batchInsert(
            self::TABLE_NAME, ['id', 'date', 'operation', 'shift', 'line', 'workcenter', 'plan', 'fact', 'operator'],[
            [ 1, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '1-2-14', 10, 8, 'Иванов И. И.'],
            [ 2, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '2-2-14', 10, 5, 'Сладков А. А.'],
            [ 3, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '3-2-14', 10, 6, 'Марков М. М.'],
            [ 4, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '4-2-14', 10, 7, 'Гога Ж. Ж.'],
            [ 5, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '5-2-14', 10, 9, 'Кулич Б. Б.'],
            [ 6, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '6-2-14', 10, 1, 'Таран Д. Д.'],
            [ 7, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '7-2-14', 10, 0, 'Марс К. К.'],
            [ 8, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '8-2-14', 10, 4, 'Демид Д. Д.'],
            [ 9, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '9-2-14', 10, 5, 'Цлав В. В.'],
            [ 10, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '10-2-14', 10, 7, 'Савин Л. Л.'],
            [ 11, '2024-12-05 00:00:00', 'Токарная с ЧПУ 4', '1', 3, '11-2-14', 10, 8, 'Зин К. К.'],
//            [ 12, '2024-12-04 00:00:00', 'Токарная с ЧПУ 4', '2', 4, '12-2-14', 10, 8, 'Лин К. К.'],
        ]);

    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable(self::TABLE_NAME);
    }
}
